CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C542CC_IIS3DWB10IS_Project1/STM32C542CC_IIS3DWB10IS_Project1_cmake/iis3dwb10is_reg.h
/*
 ******************************************************************************
 * @file    iis3dwb10is_reg.h
 * @author  Sensors Software Solution Team
 * @brief   This file contains all the functions prototypes for the
 *          iis3dwb10is_reg.c driver.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2026 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef IIS3DWB10IS_REGS_H
#define IIS3DWB10IS_REGS_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include <stddef.h>
#include <math.h>

/** @addtogroup IIS3DWB10IS
  * @{
  *
  */

/** @defgroup  Endianness definitions
  * @{
  *
  */

#ifndef DRV_BYTE_ORDER
#ifndef __BYTE_ORDER__

#define DRV_LITTLE_ENDIAN 1234
#define DRV_BIG_ENDIAN    4321

/** if _BYTE_ORDER is not defined, choose the endianness of your architecture
  * by uncommenting the define which fits your platform endianness
  */
//#define DRV_BYTE_ORDER    DRV_BIG_ENDIAN
#define DRV_BYTE_ORDER    DRV_LITTLE_ENDIAN

#else /* defined __BYTE_ORDER__ */

#define DRV_LITTLE_ENDIAN  __ORDER_LITTLE_ENDIAN__
#define DRV_BIG_ENDIAN     __ORDER_BIG_ENDIAN__
#define DRV_BYTE_ORDER     __BYTE_ORDER__

#endif /* __BYTE_ORDER__*/
#endif /* DRV_BYTE_ORDER */

/**
  * @}
  *
  */

/** @defgroup STMicroelectronics sensors common types
  * @{
  *
  */

#ifndef MEMS_SHARED_TYPES
#define MEMS_SHARED_TYPES

typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t bit0                         : 1;
  uint8_t bit1                         : 1;
  uint8_t bit2                         : 1;
  uint8_t bit3                         : 1;
  uint8_t bit4                         : 1;
  uint8_t bit5                         : 1;
  uint8_t bit6                         : 1;
  uint8_t bit7                         : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t bit7                         : 1;
  uint8_t bit6                         : 1;
  uint8_t bit5                         : 1;
  uint8_t bit4                         : 1;
  uint8_t bit3                         : 1;
  uint8_t bit2                         : 1;
  uint8_t bit1                         : 1;
  uint8_t bit0                         : 1;
#endif /* DRV_BYTE_ORDER */
} bitwise_t;

#define PROPERTY_DISABLE                (0U)
#define PROPERTY_ENABLE                 (1U)


/** @addtogroup  Interfaces_Functions
  * @brief       This section provide a set of functions used to read and
  *              write a generic register of the device.
  *              MANDATORY: return 0 -> no Error.
  * @{
  *
  */

typedef int32_t (*stmdev_write_ptr)(void *, uint8_t, const uint8_t *, uint16_t);
typedef int32_t (*stmdev_read_ptr)(void *, uint8_t, uint8_t *, uint16_t);
typedef void (*stmdev_mdelay_ptr)(uint32_t millisec);

typedef struct
{
  /** Component mandatory fields **/
  stmdev_write_ptr  write_reg;
  stmdev_read_ptr   read_reg;
  /** Component optional fields **/
  stmdev_mdelay_ptr   mdelay;
  /** Customizable optional pointer **/
  void *handle;
} stmdev_ctx_t;

/**
  * @}
  *
  */

#endif /* MEMS_SHARED_TYPES */

#ifndef MEMS_UCF_SHARED_TYPES
#define MEMS_UCF_SHARED_TYPES

/** @defgroup    Generic address-data structure definition
  * @brief       This structure is useful to load a predefined configuration
  *              of a sensor.
  *              You can create a sensor configuration by your own or using
  *              Unico / Unicleo tools available on STMicroelectronics
  *              web site.
  *
  * @{
  *
  */

typedef struct
{
  uint8_t address;
  uint8_t data;
} ucf_line_t;

/**
  * @}
  *
  */

#endif /* MEMS_UCF_SHARED_TYPES */

#ifndef MEMS_UCF_EXT_SHARED_TYPES
#define MEMS_UCF_EXT_SHARED_TYPES

/*
 * UCF extended format supports the following commands:
 * - MEMS_UCF_OP_READ: read the register at the location specified by the
 *   "address" field ("data" field is ignored
 * - MEMS_UCF_OP_WRITE: write the value specified by the "data" field at the
 *   location specified by the "address" field
 * - MEMS_UCF_OP_DELAY: wait the number of milliseconds specified by the "data"
 *   field ("address" field is ignored)
 * - MEMS_UCF_OP_POLL_SET: poll the register at the location specified by the
 *   "address" field until all the bits identified by the mask specified by the
 *   "data" field are set to 1
 * - MEMS_UCF_OP_POLL_RESET: poll the register at the location specified by the
 *   "address" field until all the bits identified by the mask specified by the
 *   "data" field are reset to 0
 */

#define MEMS_UCF_OP_READ       0
#define MEMS_UCF_OP_WRITE      1
#define MEMS_UCF_OP_DELAY      2
#define MEMS_UCF_OP_POLL_SET   3
#define MEMS_UCF_OP_POLL_RESET 4

typedef struct
{
  uint8_t op;
  uint8_t address;
  uint8_t data;
} ucf_line_ext_t;

#endif /* MEMS_UCF_EXT_SHARED_TYPES */

/** @defgroup IIS3DWB10IS_Infos
  * @{
  *
  */

/** Device Identification (Who am I) **/
#define IIS3DWB10IS_ID                           0x50U

#define IIS3DWB10IS_RAM_ACCESS                   0x01U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t sw_por                       : 1;
  uint8_t not_used0                    : 5;
  uint8_t ispu_ram_access_if           : 1;
  uint8_t page_sel                     : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t page_sel                     : 1;
  uint8_t ispu_ram_access_if           : 1;
  uint8_t not_used0                    : 5;
  uint8_t sw_por                       : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_ram_access_t;

#define IIS3DWB10IS_PIN_CTRL                     0x02U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t io_pin_strength              : 2;
  uint8_t pd_dis_int                   : 2;
  uint8_t not_used1                    : 3;
  uint8_t ibhr_por_en                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t ibhr_por_en                  : 1;
  uint8_t not_used1                    : 3;
  uint8_t pd_dis_int                   : 2;
  uint8_t io_pin_strength              : 2;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_pin_ctrl_t;

#define IIS3DWB10IS_IF_CFG                       0x3U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t i3c_disable                  : 1;
  uint8_t not_used0                    : 2;
  uint8_t int_pp_od                    : 1;
  uint8_t int_active_level             : 1;
  uint8_t not_used1                    : 2;
  uint8_t sda_pu_en                    : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t sda_pu_en                    : 1;
  uint8_t not_used1                    : 2;
  uint8_t int_active_level             : 1;
  uint8_t int_pp_od                    : 1;
  uint8_t not_used0                    : 2;
  uint8_t i3c_disable                  : 1;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_if_cfg_t;

#define IIS3DWB10IS_FIFO_CTRL1                   0x05U
typedef struct
{
  uint8_t wtm                          : 8;
} iis3dwb10is_fifo_ctrl1_t;

#define IIS3DWB10IS_FIFO_CTRL2                   0x06U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t wtm                          : 4;
  uint8_t dec_ts_batch                 : 2;
  uint8_t fifo_trigger_cfg             : 1;
  uint8_t fifo_read_from_ispu          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t fifo_read_from_ispu          : 1;
  uint8_t fifo_trigger_cfg             : 1;
  uint8_t dec_ts_batch                 : 2;
  uint8_t wtm                          : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_fifo_ctrl2_t;

#define IIS3DWB10IS_FIFO_CTRL3                   0x07U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t fifo_mode                    : 3;
  uint8_t xl_batch                     : 1;
  uint8_t t_batch                      : 1;
  uint8_t ispu_batch                   : 1;
  uint8_t not_used0                    : 1;
  uint8_t stop_on_wtm                  : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t stop_on_wtm                  : 1;
  uint8_t not_used0                    : 1;
  uint8_t ispu_batch                   : 1;
  uint8_t t_batch                      : 1;
  uint8_t xl_batch                     : 1;
  uint8_t fifo_mode                    : 3;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_fifo_ctrl3_t;

#define IIS3DWB10IS_COUNTER_BDR_H                0x08U
typedef struct
{
#if DRV_BYTE_ORDER == DRV_LITTLE_ENDIAN
  uint8_t cnt_bdr_th               : 4;
  uint8_t rst_counter_bdr_rd_diff  : 1;
  uint8_t trigger_counter_bdr      : 1;
  uint8_t no_used                  : 1;
  uint8_t rst_counter_bdr          : 1;
#elif DRV_BYTE_ORDER == DRV_BIG_ENDIAN
  uint8_t rst_counter_bdr          : 1;
  uint8_t no_used                  : 1;
  uint8_t trigger_counter_bdr      : 1;
  uint8_t rst_counter_bdr_rd_diff  : 1;
  uint8_t cnt_bdr_th               : 4;
#endif /* DRV_BYTE_ORDER */
} iis3dwb10is_counter_bdr_h_t;

