CoreMaker-lab/STM32C542CC_IIS3DWB10IS/STM32C542CC_IIS3DWB10IS_Project1/STM32C542CC_IIS3DWB10IS_Project1_cmake/iis3dwb10is_reg.h
typedef enum
{
  IIS3DWB10IS_ISPU_RATE_IDLE  = 0x0,
  IIS3DWB10IS_ISPU_RATE_2KHz5 = 0x2,
  IIS3DWB10IS_ISPU_RATE_5KHz  = 0x3,
  IIS3DWB10IS_ISPU_RATE_10KHz = 0x4,
  IIS3DWB10IS_ISPU_RATE_20KHz = 0x5,
  IIS3DWB10IS_ISPU_RATE_40KHz = 0x6,
  IIS3DWB10IS_ISPU_RATE_80KHz = 0x7,
} iis3dwb10is_ispu_rate_t;
int32_t iis3dwb10is_ispu_rate_set(const stmdev_ctx_t *ctx, iis3dwb10is_ispu_rate_t val);
int32_t iis3dwb10is_ispu_rate_get(const stmdev_ctx_t *ctx, iis3dwb10is_ispu_rate_t *val);

int32_t iis3dwb10is_ispu_bdu_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_ispu_bdu_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb10is_grant_ispu_regs_access_set(const stmdev_ctx_t *ctx, uint8_t val);
int32_t iis3dwb10is_grant_ispu_regs_access_get(const stmdev_ctx_t *ctx, uint8_t *val);

int32_t iis3dwb10is_ispu_trigger_interrupt(const stmdev_ctx_t *ctx, uint8_t val);

typedef struct
{
  uint16_t ispu_ia;
} iis3dwb10is_ispu_int_status_t;

int32_t iis3dwb10is_ispu_status_get(const stmdev_ctx_t *ctx, iis3dwb10is_ispu_int_status_t *val);

int32_t iis3dwb10is_tpf_get(const stmdev_ctx_t *ctx, uint8_t *val);

typedef struct
{
  uint8_t ctrl_access          : 1;
  uint8_t core_sleep           : 1;
} iis3dwb10is_ispu_dev_status_t;

int32_t iis3dwb10is_ispu_dev_status_get(const stmdev_ctx_t *ctx,
                                        iis3dwb10is_ispu_dev_status_t *val);

typedef struct
{
  uint8_t fifo_en             : 1;
  uint8_t sleepcnt_en         : 1;
  uint8_t ext_trg_en          : 1;
  uint8_t user_trg_en         : 1;
  uint8_t temp_en             : 1;
} iis3dwb10is_ispu_loprio_cfg_t;

int32_t iis3dwb10is_ispu_loprio_cfg_set(const stmdev_ctx_t *ctx,
                                        iis3dwb10is_ispu_loprio_cfg_t val);
int32_t iis3dwb10is_ispu_loprio_cfg_get(const stmdev_ctx_t *ctx,
                                        iis3dwb10is_ispu_loprio_cfg_t *val);

typedef enum
{
  IIS3DWB10IS_ISPU_TURN_ON =              0x0,
  IIS3DWB10IS_ISPU_TURN_OFF =             0x1,
} iis3dwb10is_ispu_boot_latched_t;
int32_t iis3dwb10is_ispu_boot_set(const stmdev_ctx_t *ctx,
                                  iis3dwb10is_ispu_boot_latched_t val);

typedef enum
{
  IIS3DWB10IS_ISPU_INT_PULSED_PIN_PULSED   = 0x0,
  IIS3DWB10IS_ISPU_INT_LATCHED_PIN_PULSED  = 0x1,
  IIS3DWB10IS_ISPU_INT_LATCHED_PIN_LATCHED = 0x2,
} iis3dwb10is_ispu_int_latched_t;
int32_t iis3dwb10is_ispu_int_latched_set(const stmdev_ctx_t *ctx,
                                         iis3dwb10is_ispu_int_latched_t val);
int32_t iis3dwb10is_ispu_int_latched_get(const stmdev_ctx_t *ctx,
                                         iis3dwb10is_ispu_int_latched_t *val);

typedef enum
{
  IIS3DWB10IS_ISPU_BOOT_IN_PROGRESS =     0x0,
  IIS3DWB10IS_ISPU_BOOT_ENDED =           0x1,
} iis3dwb10is_ispu_boot_end_t;
int32_t iis3dwb10is_ispu_get_boot_status(const stmdev_ctx_t *ctx,
                                         iis3dwb10is_ispu_boot_end_t *val);

#define IIS3DWB10IS_ISPU_DATA_RAM_START    0x2000
#define IIS3DWB10IS_ISPU_PROGRAM_RAM_START 0x0

typedef enum
{
  IIS3DWB10IS_ISPU_DATA_RAM_MEMORY =      0x0,
  IIS3DWB10IS_ISPU_PROGRAM_RAM_MEMORY =   0x1,
} iis3dwb10is_ispu_memory_type_t;

int32_t iis3dwb10is_ispu_write_memory(const stmdev_ctx_t *ctx,
                                      iis3dwb10is_ispu_memory_type_t mem_sel,
                                      uint16_t mem_addr, uint8_t *mem_data, uint16_t len);
int32_t iis3dwb10is_ispu_read_memory(const stmdev_ctx_t *ctx,
                                     iis3dwb10is_ispu_memory_type_t mem_sel,
                                     uint16_t mem_addr, uint8_t *mem_data, uint16_t len);

int32_t iis3dwb10is_ispu_write_flags(const stmdev_ctx_t *ctx, uint16_t data);
int32_t iis3dwb10is_ispu_read_flags(const stmdev_ctx_t *ctx, uint16_t *data);
int32_t iis3dwb10is_ispu_clear_flags(const stmdev_ctx_t *ctx);

int32_t iis3dwb10is_ispu_int1_ctrl_get(const stmdev_ctx_t *ctx, uint16_t *val);
int32_t iis3dwb10is_ispu_int1_ctrl_set(const stmdev_ctx_t *ctx, uint16_t val);
int32_t iis3dwb10is_ispu_int2_ctrl_get(const stmdev_ctx_t *ctx, uint16_t *val);
int32_t iis3dwb10is_ispu_int2_ctrl_set(const stmdev_ctx_t *ctx, uint16_t val);

int32_t iis3dwb10is_ispu_int_status_get(const stmdev_ctx_t *ctx, uint16_t *val);

int32_t iis3dwb10is_ispu_algo_get(const stmdev_ctx_t *ctx, uint16_t *val);
int32_t iis3dwb10is_ispu_algo_set(const stmdev_ctx_t *ctx, uint16_t val);

/**
  * @}
  *
  */

#ifdef __cplusplus
}
#endif

#endif /* IIS3DWB10IS_REGS_H */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
